{
    "Locator": [
        {
        "id": "ALPA",
        "title": "ALPA Health",
        "Address": "5901 W Olympic Blvd Ste 310 Los Angeles, 90036",
        "Website": "https://aplahealth.org/",
        "Services": "HIV testing",
        "Phone": "3232151725",
        "About": "APLA Health restores dignity and trust within underserved communities by providing world-class LGBTQ+ empowering healthcare, HIV specialty care, food, housing and other essential support services. Since 1983, APLA Health has remained steadfast in its commitment to ending the HIV/AIDS epidemic in our lifetime. The agency, a multi-site operation, includes seven Federally Qualified health Center (FQHC) locations serving more than 18,000 people annually in Los Angeles County, the nation’s most populous. We provide 20 different services including: medical, dental, and behavioral healthcare; HIV specialty care; Sexual Health Services & Community Resources. For people living with HIV, we offer housing support services through the Alliance for Housing & Healing; benefits counseling; home healthcare; and the Vance North Necessities of Life Program food pantry program. Additionally, we are leaders in advocating for policy and legislation that positively impact the LGBTQ+ and HIV communities we serve.",
        "imageUrl": "../../images/Model3/APLA.png"
        },
        {
        "id": "Alta",
        "title": "AltaMed Medical Group",
        "Address": "5427 E Whittier Blvd Los Angeles, 90022",
        "Website": "https://www.altamed.org/",
        "Services": "STI testing and Treatment, Mpox Vaccine",
        "Phone": "3234006399, 8884999303 (Mpox Vaccine)",
        "About": "AltaMed Health Services adheres to the Primary Care Medical Home (PCMH) concept. We have developed an approach to primary care consistent with the PCMH model that aims to deliver high-quality, cost-effective primary care. Using a patient-centered, culturally appropriate, and team-based approach, the PCMH model coordinates patient care across the health system to improve the patient experience. At AltaMed, our team of providers is committed to ensuring complete, coordinated care, treatment, and services as evidenced by our Joint Commission PCMH certification.",
        "imageUrl": "../../images/Model3/AltaMed.png"
        },
        {
        "id": "Torrance",
        "title": "Torrance Urgent Care",
        "Address": "2195 Sepulveda Blvd Torrance US, 90501",
        "Website": "https://exerurgentcare.com/locations_blue/torrance-north/",
        "Services": "PEP",
        "Phone": "4243371600",
        "About": "Our doctors and staff are uniquely trained to treat patients with emergency-level acuity of care, but we’re also close at hand.  We live in the communities we serve, and we treat our patients like our neighbors because, well, we are your neighbors. We believe that what’s good for you is better for all of us. We’ve also felt the shock of opening hospital bills we can’t afford. We know the frustration of waiting for hours at “urgent care” clinics for subpar treatment. And that’s why we’ve decided to do things differently, to reimagine the local walk-in clinic experience to put patient needs first. Because there is a difference between providing care and taking care. We’re treating our patients like we would our own families. That means care that isn’t only faster and better, but gives you peace of mind knowing you’re getting expert attention in a comfortable premium setting, close to home. All so you can feel better, faster.",
        "imageUrl": "../../images/Model3/Torrance.png"
        }
    ]
}